ahtn/keyplus/ports/efm8/efm8/mcu/C8051F990/inc/SI_C8051F990_Register_Enums.h
#define TMR2CN_TF2LEN__BMASK                 0x20 ///< Timer 2 Low Byte Interrupt Enable                 
#define TMR2CN_TF2LEN__SHIFT                 0x05 ///< Timer 2 Low Byte Interrupt Enable                 
#define TMR2CN_TF2LEN__DISABLED              0x00 ///< Disable low byte interrupts.                      
#define TMR2CN_TF2LEN__ENABLED               0x20 ///< Enable low byte interrupts.                       
                                                                                                         
#define TMR2CN_TF2L__BMASK                   0x40 ///< Timer 2 Low Byte Overflow Flag                    
#define TMR2CN_TF2L__SHIFT                   0x06 ///< Timer 2 Low Byte Overflow Flag                    
#define TMR2CN_TF2L__NOT_SET                 0x00 ///< Timer 2 low byte did not overflow.                
#define TMR2CN_TF2L__SET                     0x40 ///< Timer 2 low byte overflowed.                      
                                                                                                         
#define TMR2CN_TF2H__BMASK                   0x80 ///< Timer 2 High Byte Overflow Flag                   
#define TMR2CN_TF2H__SHIFT                   0x07 ///< Timer 2 High Byte Overflow Flag                   
#define TMR2CN_TF2H__NOT_SET                 0x00 ///< Timer 2 8-bit high byte or 16-bit value did not   
                                                  ///< overflow.                                         
#define TMR2CN_TF2H__SET                     0x80 ///< Timer 2 8-bit high byte or 16-bit value           
                                                  ///< overflowed.                                       
                                                                                                         
//------------------------------------------------------------------------------
// TMR2H Enums (Timer 2 High Byte @ 0xCD)
//------------------------------------------------------------------------------
#define TMR2H_TMR2H__FMASK 0xFF ///< Timer 2 High Byte
#define TMR2H_TMR2H__SHIFT 0x00 ///< Timer 2 High Byte
                                                      
//------------------------------------------------------------------------------
// TMR2L Enums (Timer 2 Low Byte @ 0xCC)
//------------------------------------------------------------------------------
#define TMR2L_TMR2L__FMASK 0xFF ///< Timer 2 Low Byte
#define TMR2L_TMR2L__SHIFT 0x00 ///< Timer 2 Low Byte
                                                     
//------------------------------------------------------------------------------
// TMR2RLH Enums (Timer 2 Reload High Byte @ 0xCB)
//------------------------------------------------------------------------------
#define TMR2RLH_TMR2RLH__FMASK 0xFF ///< Timer 2 Reload High Byte
#define TMR2RLH_TMR2RLH__SHIFT 0x00 ///< Timer 2 Reload High Byte
                                                                 
//------------------------------------------------------------------------------
// TMR2RLL Enums (Timer 2 Reload Low Byte @ 0xCA)
//------------------------------------------------------------------------------
#define TMR2RLL_TMR2RLL__FMASK 0xFF ///< Timer 2 Reload Low Byte
#define TMR2RLL_TMR2RLL__SHIFT 0x00 ///< Timer 2 Reload Low Byte
                                                                
//------------------------------------------------------------------------------
// TMR3CN Enums (Timer 3 Control @ 0x91)
//------------------------------------------------------------------------------
#define TMR3CN_T3XCLK__FMASK                    0x03 ///< Timer 3 External Clock Select                     
#define TMR3CN_T3XCLK__SHIFT                    0x00 ///< Timer 3 External Clock Select                     
#define TMR3CN_T3XCLK__SYSCLK_DIV_12_CAP_RTC    0x00 ///< External Clock is SYSCLK/12. Capture trigger is   
                                                     ///< RTC.                                              
#define TMR3CN_T3XCLK__EXTOSC_DIV_8_CAP_RTC     0x01 ///< External Clock is External Oscillator/8. Capture  
                                                     ///< trigger is RTC.                                   
#define TMR3CN_T3XCLK__SYSCLK_DIV_12_CAP_EXTOSC 0x02 ///< External Clock is SYSCLK/12. Capture trigger is   
                                                     ///< External Oscillator/8.                            
#define TMR3CN_T3XCLK__RTC_CAP_EXTOSC           0x03 ///< External Clock is RTC. Capture trigger is External
                                                     ///< Oscillator/8.                                     
                                                                                                            
#define TMR3CN_TR3__BMASK                       0x04 ///< Timer 3 Run Control                               
#define TMR3CN_TR3__SHIFT                       0x02 ///< Timer 3 Run Control                               
#define TMR3CN_TR3__STOP                        0x00 ///< Stop Timer 3.                                     
#define TMR3CN_TR3__RUN                         0x04 ///< Start Timer 3 running.                            
                                                                                                            
#define TMR3CN_T3SPLIT__BMASK                   0x08 ///< Timer 3 Split Mode Enable                         
#define TMR3CN_T3SPLIT__SHIFT                   0x03 ///< Timer 3 Split Mode Enable                         
#define TMR3CN_T3SPLIT__16_BIT_RELOAD           0x00 ///< Timer 3 operates in 16-bit auto-reload mode.      
#define TMR3CN_T3SPLIT__8_BIT_RELOAD            0x08 ///< Timer 3 operates as two 8-bit auto-reload timers. 
                                                                                                            
#define TMR3CN_TF3CEN__BMASK                    0x10 ///< Timer 3 Capture Enable                            
#define TMR3CN_TF3CEN__SHIFT                    0x04 ///< Timer 3 Capture Enable                            
#define TMR3CN_TF3CEN__DISABLED                 0x00 ///< Disable capture mode.                             
#define TMR3CN_TF3CEN__ENABLED                  0x10 ///< Enable capture mode.                              
                                                                                                            
#define TMR3CN_TF3LEN__BMASK                    0x20 ///< Timer 3 Low Byte Interrupt Enable                 
#define TMR3CN_TF3LEN__SHIFT                    0x05 ///< Timer 3 Low Byte Interrupt Enable                 
#define TMR3CN_TF3LEN__DISABLED                 0x00 ///< Disable low byte interrupts.                      
#define TMR3CN_TF3LEN__ENABLED                  0x20 ///< Enable low byte interrupts.                       
                                                                                                            
#define TMR3CN_TF3L__BMASK                      0x40 ///< Timer 3 Low Byte Overflow Flag                    
#define TMR3CN_TF3L__SHIFT                      0x06 ///< Timer 3 Low Byte Overflow Flag                    
#define TMR3CN_TF3L__NOT_SET                    0x00 ///< Timer 3 low byte did not overflow.                
#define TMR3CN_TF3L__SET                        0x40 ///< Timer 3 low byte overflowed.                      
                                                                                                            
#define TMR3CN_TF3H__BMASK                      0x80 ///< Timer 3 High Byte Overflow Flag                   
#define TMR3CN_TF3H__SHIFT                      0x07 ///< Timer 3 High Byte Overflow Flag                   
#define TMR3CN_TF3H__NOT_SET                    0x00 ///< Timer 3 8-bit high byte or 16-bit value did not   
                                                     ///< overflow.                                         
#define TMR3CN_TF3H__SET                        0x80 ///< Timer 3 8-bit high byte or 16-bit value           
                                                     ///< overflowed.                                       
                                                                                                            
//------------------------------------------------------------------------------
// TMR3H Enums (Timer 3 High Byte @ 0x95)
//------------------------------------------------------------------------------
#define TMR3H_TMR3H__FMASK 0xFF ///< Timer 3 High Byte
#define TMR3H_TMR3H__SHIFT 0x00 ///< Timer 3 High Byte
                                                      
//------------------------------------------------------------------------------
// TMR3L Enums (Timer 3 Low Byte @ 0x94)
//------------------------------------------------------------------------------
#define TMR3L_TMR3L__FMASK 0xFF ///< Timer 3 Low Byte
#define TMR3L_TMR3L__SHIFT 0x00 ///< Timer 3 Low Byte
                                                     
//------------------------------------------------------------------------------
// TMR3RLH Enums (Timer 3 Reload High Byte @ 0x93)
//------------------------------------------------------------------------------
#define TMR3RLH_TMR3RLH__FMASK 0xFF ///< Timer 3 Reload High Byte
#define TMR3RLH_TMR3RLH__SHIFT 0x00 ///< Timer 3 Reload High Byte
                                                                 
//------------------------------------------------------------------------------
// TMR3RLL Enums (Timer 3 Reload Low Byte @ 0x92)
//------------------------------------------------------------------------------
#define TMR3RLL_TMR3RLL__FMASK 0xFF ///< Timer 3 Reload Low Byte
#define TMR3RLL_TMR3RLL__SHIFT 0x00 ///< Timer 3 Reload Low Byte
                                                                
//------------------------------------------------------------------------------
// CKCON Enums (Clock Control @ 0x8E)
//------------------------------------------------------------------------------
#define CKCON_SCA__FMASK           0x03 ///< Timer 0/1 Prescale                             
#define CKCON_SCA__SHIFT           0x00 ///< Timer 0/1 Prescale                             
#define CKCON_SCA__SYSCLK_DIV_12   0x00 ///< System clock divided by 12.                    
#define CKCON_SCA__SYSCLK_DIV_4    0x01 ///< System clock divided by 4.                     
#define CKCON_SCA__SYSCLK_DIV_48   0x02 ///< System clock divided by 48.                    
#define CKCON_SCA__EXTOSC_DIV_8    0x03 ///< External oscillator divided by 8 (synchronized 
                                        ///< with the system clock).                        
                                                                                            
#define CKCON_T0M__BMASK           0x04 ///< Timer 0 Clock Select                           
#define CKCON_T0M__SHIFT           0x02 ///< Timer 0 Clock Select                           
#define CKCON_T0M__PRESCALE        0x00 ///< Counter/Timer 0 uses the clock defined by the  
                                        ///< prescale field, SCA.                           
#define CKCON_T0M__SYSCLK          0x04 ///< Counter/Timer 0 uses the system clock.         
                                                                                            
#define CKCON_T1M__BMASK           0x08 ///< Timer 1 Clock Select                           
#define CKCON_T1M__SHIFT           0x03 ///< Timer 1 Clock Select                           
#define CKCON_T1M__PRESCALE        0x00 ///< Timer 1 uses the clock defined by the prescale 
                                        ///< field, SCA.                                    
#define CKCON_T1M__SYSCLK          0x08 ///< Timer 1 uses the system clock.                 
                                                                                            
